mesh_study/case_200L/case_200L_mesh2/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basicMultiphaseSystem;

phases (air water);

air
{
    type            purePhaseModel;
    diameterModel   isothermal;
    isothermalCoeffs
    {
        d0              0.004;
        p0              100000.0;
    }
    residualAlpha   1e-4;

}

water
{
    type            purePhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }
    residualAlpha   1e-4;
}

blending
{
    default
    {
        type            linear;
        residualAlpha   1e-3;
        minFullyContinuousAlpha.air 0.7;
        minPartlyContinuousAlpha.air 0.3;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.3;
    }

    drag
    {
        type            linear;
        residualAlpha   1e-3;
        minFullyContinuousAlpha.air 0.7;
        minPartlyContinuousAlpha.air 0.5;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.5;
    }
}

surfaceTension
{
    air_water
    {
        type            constant;
        sigma           0.07;
    }
}

drag
{
    air_dispersedIn_water
    {
        type            SchillerNaumann;
        residualAlpha   1e-3;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    water_dispersedIn_air
    {
        type            SchillerNaumann;
        residualAlpha   1e-3;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    air_segregatedWith_water
    {
        type            segregated;
        m               0.5;
        n               8;
        swarmCorrection
        {
            type        none;
        }
    }
}

virtualMass
{
    air_dispersedIn_water
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
    water_dispersedIn_air
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

heatTransfer
{
    air_dispersedIn_water
    {
        type            RanzMarshall;
        residualAlpha   1e-3;
    }
    water_dispersedIn_air
    {
        type            RanzMarshall;
        residualAlpha   1e-3;
    }
}

lift
{}

wallLubrication
{}

phaseTransfer
{}

turbulentDispersion
{
    air_dispersedIn_water
    {
        type            LopezDeBertodano;
	Ctd             1.0;
        residualAlpha   1e-3;
    }
    water_dispersedIn_air
    {
        type            none;
    }
}


// ************************************************************************* //
