mesh_study/case_200L/case_200L_mesh2/0.org/k.air.template
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform |-k_in-|;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        phi             phi.water;
        inletValue      uniform |-k_out-|;
        value           uniform |-k_out-|;
    }
    sparger_upper
    {
        type            fixedValue;
	inletValue      $internalField;
        value           $internalField;
    }
    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
