mesh_study/case_200L/case_200L_mesh2/system/include/probe_locations
// x y z //
( 0.1341722046560542 0.11580058618361175 0.1341722046560542 )
( 0.1341722046560542 0.21685503030638903 0.1341722046560542 )
( 0.1341722046560542 0.5963513333425698 0.1341722046560542 )
( 0.1341722046560542 0.9758476363787506 0.1341722046560542 )
